# 연습문제

## 1. 시리즈에서 리스트로 변환하기

In [2]:
# data analysis libraries
import pandas as pd
import numpy as np

In [7]:
test = pd.read_csv("C:/Users/hd00m/Python/Data_Kaggle/titanic/test.csv")

In [26]:
test[['PassengerId', 'Pclass']]

     PassengerId  Pclass
0            892       3
1            893       3
2            894       2
3            895       3
4            896       3
..           ...     ...
413         1305       3
414         1306       1
415         1307       3
416         1308       3
417         1309       3

[418 rows x 2 columns]

In [4]:
list_PassengerId=list(test.loc[:,'PassengerId'])
int(892) in list_PassengerId

True

## 2. input

In [5]:
x=input()

hello

In [6]:
x

'hello'

In [3]:
test_df = pd.read_csv("C:/Users/hd00m/Python/Data_Kaggle/titanic/test.csv", index_col='PassengerId')
test_df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [31]:
index=int(input("이름을 입력하세요 : \n"))
print("%d 등급입니다." %(test.loc[test['PassengerId'] == index, ['Pclass']].to_numpy()[0][0]))

이름을 입력하세요 :
894
2 등급입니다.

In [32]:
pclass= test.loc[test['PassengerId'] == 894, ['Pclass']]
print(pclass)
print(type(pclass))
a = pclass.to_numpy()
print(a)
print(a[0])
print(a[0][0])
print(type(a[0][0]))
b=a[0][0]

   Pclass
2       2
<class 'pandas.core.frame.DataFrame'>
[[2]]
[2]
2
<class 'numpy.int64'>

In [30]:
test.loc[test['PassengerId'] == 894, ['Pclass']].to_numpy()[0][0]

2

In [97]:
pd.to_numeric(test['PassengerId'])

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [89]:
test_df.iloc[1]

Pclass                                     3
Name        Wilkes, Mrs. James (Ellen Needs)
Sex                                   female
Age                                     47.0
SibSp                                      1
Parch                                      0
Ticket                                363272
Fare                                     7.0
Cabin                                    NaN
Embarked                                   S
Name: 893, dtype: object